darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
      // v5.0.53: MQTT publish для Home Assistant Discovery.
      // Опубликуется только если MQTT включён в настройках + WiFi connected.
      // v5.0.55: force read temperature если ещё нет валидного значения (после wake
      // async-read может не успеть до log_append). Fallback на persist.lastTempC.
      float mqttTempC = sys.tempData.temperature;
      if (mqttTempC <= -90.0f && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) {
          sys.tempData = fresh;
          mqttTempC = fresh.temperature;
        }
      }
      if (mqttTempC <= -90.0f && persist.lastTempC > -90.0f) {
        mqttTempC = persist.lastTempC;  // fallback на старое валидное
      }
      long rssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;
      mqtt_publish_data(sys.smoothedWeight,
                        mqttTempC,
                        sys.batVoltage,
                        sys.batPercent,
                        rssi);
    }
  }

  // v5.0.56/57: периодический MQTT publish когда ESP active (вне log_append cycle).
  // Интервал настраивается через UI (default 60 сек, range 10-3600).
  // В sleep mode не вызывается (ESP off).
  static unsigned long lastMqttTick = 0;
  MqttSettings mqttCfg;
  load_mqtt(mqttCfg);
  unsigned long mqttIntervalMs = (unsigned long)mqttCfg.interval * 1000UL;
  if (mqttIntervalMs < 10000UL) mqttIntervalMs = 60000UL;
  if (now - lastMqttTick >= mqttIntervalMs) {
    lastMqttTick = now;
    float liveT = sys.tempData.temperature;
    if (liveT <= -90.0f && persist.lastTempC > -90.0f) liveT = persist.lastTempC;
    long liveRssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;
    mqtt_publish_data(sys.smoothedWeight,
                      liveT,
                      sys.batVoltage,
                      sys.batPercent,
                      liveRssi);
  }
#endif

  lcd_backlight_tick(lcd, get_lcd_bl_sec());

  wifi_ensure_connected();
  // Определяем "эффективный" режим WiFi по факту, а не из EEPROM:
  // если STA-подключение упало и wifi_init() сделал fallback на AP, EEPROM остаётся в STA,
  // но реально работаем в AP. Без этой проверки веб-сервер останавливается через 7 сек.
  bool isApMode = (get_wifi_mode() == 0) || (WiFi.getMode() == WIFI_AP);
  if (isApMode) {
    sys.wifiOk = (WiFi.softAPIP() != IPAddress(0,0,0,0));
  } else {
    sys.wifiOk = (WiFi.status() == WL_CONNECTED);
    if (!sys.wifiOk && webServerStarted) {
      // Корректно останавливаем web-сервер перед сбросом флага — иначе при
      // реконнекте повторный _srv.begin() поверх живого слушающего сокета
      // может вести к утечкам / двойным handlers (пункт 7).
      webserver_stop();
      webServerStarted = false;
    }
    // v5.0.23: ntp_loop() ОТКЛЮЧЁН — баг configTime/getLocalTime в ESP32
    // Core 3.0.7 даёт Guru Meditation InstrFetchProhibited.
    // DS3231 RTC даёт точное время самостоятельно. Ручной NTP остаётся
    // через POST /api/ntp если пользователь нажмёт кнопку.
    // ntp_loop();
  }

  if (sys.wifiOk && !webServerStarted) {
    start_webserver();
  }

  if (sys.wifiOk && webServerStarted) {
    webserver_handle();
    static unsigned long lastQueueProc = 0;
    if (now - lastQueueProc >= 60000UL) {
      queue_process();
      lastQueueProc = now;
    }
  }

  if (get_wifi_mode() == 1 && sys.wifiOk) {
    if (now - lastTsUpload >= TS_UPDATE_INTERVAL_MS) {
      float rtcT = rtc_temperature();
      if (!ts_send(sys.smoothedWeight, sys.tempData.temperature,
                   sys.tempData.humidity, rtcT)) {
        queue_add(sys.smoothedWeight, sys.tempData.temperature, 
                  sys.tempData.humidity, rtcT, sys.datetimeStr);
      }
      lastTsUpload = now;
    }

    // v5.0.45: УПРОЩЁННАЯ логика TG отправки.
    //   - Если расписание: tgReportPending=true → TG на каждом scheduled wake
    //   - Если расписания нет: TG шлётся ОДИН РАЗ за wake (cold boot) — каждое
    //     пробуждение из power-cut sleep = новый TG отчёт (юзеру это интуитивно).
    // Старый interval-check (tgRptMs vs millis/unix) удалён — был непонятен.
    // tgRptMs=0 (TG отключён) — single switch для полного выключения TG.
    uint32_t tgRptMs = get_tg_report_interval_min() * 60000UL;
    uint8_t schedCnt = 0; uint16_t schedT[8]; get_sched_times(schedT, schedCnt);
    static bool tgSentSinceBoot = false;
    bool doTgReport = false;
    if (tgReportPending) {
      doTgReport = true;
    } else if (!tgSentSinceBoot && schedCnt == 0 && tgRptMs > 0 && load_tg_on_interval()) {
      // v5.0.48: TG в interval-mode только если galочка "Слать TG при wake без расписания" вкл.
      // Без расписания + tg_on_interval=true → каждый cold-boot wake = TG.
      // Без расписания + tg_on_interval=false → TG не шлётся вообще (тестовый режим).
      doTgReport = true;
    }
    if (doTgReport) {
      TimeStamp ts = rtc_now();
      String dt = rtc_format_datetime(ts);

      // v5.0.5: гарантируем актуальную температуру перед отправкой отчёта.
      // После deep-sleep wake-up DS18B20 часто не успевает прочитаться через async
      // process_temperature() — первое чтение всегда пропускается (power-on 85°C),
      // а отчёт уходит в первые 5-10 сек. Делаем синхронный force-read (~750мс).
      // Если всё равно невалидно — fallback на persist.lastTempC (последняя сохранённая).
      float reportTempC = sys.tempData.temperature;
      if (reportTempC <= -90.0f && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) {
          sys.tempData = fresh;
          reportTempC = fresh.temperature;
        }
      }
      if (reportTempC <= -90.0f && persist.lastTempC > -90.0f) {
        reportTempC = persist.lastTempC;  // fallback на старое валидное значение
      }

      // v5.0.62: привес за сутки — только в вечернем (последнем по времени) слоте
      // расписания. Сравниваем с весом вчерашнего вечера (load_evening_weight).
      bool     isEveningSlot = false;
      bool     hasDailyGain  = false;
      float    prevEveningW  = 0.0f;
      uint16_t curDayNum     = 0;
      uint16_t maxSlot       = 0;
      if (schedCnt > 0 && ts.valid) {
        for (uint8_t i = 0; i < schedCnt; i++) if (schedT[i] > maxSlot) maxSlot = schedT[i];
        uint16_t cur_min = (uint16_t)ts.hour * 60 + ts.minute;
        int diff = (int)cur_min - (int)maxSlot;
        if (diff < 0) diff = -diff;
        isEveningSlot = (diff <= 15);  // ±15 мин от вечернего слота
        DateTime dtCur(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
        curDayNum = (uint16_t)(dtCur.unixtime() / 86400UL);
        if (isEveningSlot) {
          float storedW; uint16_t storedDay;
          // показываем привес только если есть запись с ДРУГОГО дня (сутки→сутки)
          if (load_evening_weight(storedW, storedDay) && storedDay != curDayNum) {
            hasDailyGain = true;
            prevEveningW = storedW;
          }
        }
      }

      bool tgOk = tg_send_report(sys.smoothedWeight, reportTempC,
                         sys.tempData.humidity, dt,
                         sys.prevWeight, load_prev_weight_date(),
                         persist.lastReportWeight, persist.hasLastReport,
                         hasDailyGain, prevEveningW, maxSlot);
      if (!tgOk && sys.currentTime.valid) {
        // v5.0.58: TG fail → сохранить для retry при next wake
        DateTime ntp(sys.currentTime.year, sys.currentTime.month, sys.currentTime.day,
                     sys.currentTime.hour, sys.currentTime.minute, sys.currentTime.second);
        int8_t rssi = (WiFi.status() == WL_CONNECTED) ? (int8_t)WiFi.RSSI() : 0;
        tg_pending_save(ntp.unixtime(), sys.smoothedWeight, reportTempC,
                        sys.batVoltage, (uint8_t)sys.batPercent, rssi);
        Serial.println(F("[TG] Send failed — saved for retry at next wake"));
      }
      if (tgOk) {
        tgReportPending = false;
        lastTgReport = now;
        tgSentSinceBoot = true;  // v5.0.45: блокировать повторную отправку в этом wake
        // После успешной отправки: текущий вес становится "вчерашним" для следующего отчёта.
        persist.lastReportWeight = sys.smoothedWeight;
        persist.hasLastReport = true;
        if (reportTempC > -90.0f) persist.lastTempC = reportTempC;
        sleep_save_persistent(persist);
        // v5.0.4: дублируем reportWeight в EEPROM, чтобы дельта не пропадала после reset/прошивки.
        save_last_report(sys.smoothedWeight, true);
        // v5.0.5: то же для температуры — fallback после reset.
        if (reportTempC > -90.0f) save_last_temp(reportTempC);
        // v5.0.62: вечерний слот → сохранить вес как базу для привеса завтра.
        if (isEveningSlot && curDayNum > 0) {
          save_evening_weight(sys.smoothedWeight, curDayNum);
        }
      }
      // если не отправилось (нет WiFi, нет токена) — флаг остаётся, попробуем позже
    }

