darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
    // v5.0.58: попытка отправить задержанный TG если он есть (от прошлого fail).
    // Делаем только раз за boot (после успешного WiFi connect).
    static bool tgPendingTried = false;
    if (!tgPendingTried && WiFi.status() == WL_CONNECTED) {
      tgPendingTried = true;
      TgPendingData pd;
      if (tg_pending_load(pd)) {
        Serial.print(F("[TgPending] Found pending TG from unix="));
        Serial.println(pd.unixtime);
        bool ok = tg_send_pending(pd.unixtime, pd.weight, pd.tempC,
                                  pd.batV, pd.batPct, pd.rssi);
        if (ok) {
          tg_pending_clear();
          Serial.println(F("[TgPending] Late report sent OK"));
        } else {
          tg_pending_inc_retry();
          Serial.println(F("[TgPending] Late retry failed"));
        }
      }
    }
  }

  check_auto_sleep();

#ifdef SLEEP_MODE_DEEP_SLEEP
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  // v5.0.29: wakeupCount++ перенесён ВНУТРЬ sleep_enter() (инкремент после wake).
  sleep_save_persistent(persist);
  uint32_t sleepDur = sys.currentTime.valid
    ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
    : get_sleep_sec();
  if (sleepDur < 60) sleepDur = 60;
  Serial.print(F("[Sleep] Sleep for "));
  Serial.print(sleepDur);
  Serial.println(F(" sec"));
  sleep_enter(sleepDur);
  // v5.0.29: Light sleep RETURNS — loop продолжается с этой точки.
  // WiFi уже подключён (modem-sleep сохраняет association). Web/TG готовы.
  lastActivityTime = millis();  // сброс idle-таймера на новый цикл активности
#endif
}

void handle_buttons() {
  // Boot grace period: первые 2 секунды после старта игнорируем кнопки.
  // На ESP8266 это критично из-за boot-strap пинов GPIO0/2; на ESP32 (GPIO27/26 — RTC)
  // таких проблем нет, но небольшой grace всё равно защищает от наводок при инициализации I2C/WiFi.
  if (millis() < 2000UL) {
    // На всякий случай ещё раз чистим ISR-флаги
    noInterrupts();
    btnMain.irqFell = false;
    btnMenu.irqFell = false;
    interrupts();
    return;
  }

  // Wake-press guard: после boot / deep-sleep-wake кнопка часто ещё физически удерживается
  // (пользователь только что её нажал, чтобы разбудить). Если начать считать удержание прямо
  // отсюда, через ~3.5 сек реального удержания сработает MEDIUM_PRESS → выскочит диалог тары
  // сам по себе. Поэтому игнорируем MAIN-кнопку до её первого release. Pressing-цикл начнёт
  // считаться только со следующего, "осознанного" нажатия.
  static bool waitFirstReleaseMain = true;
  if (waitFirstReleaseMain) {
    if (digitalRead(BUTTON_PIN) == HIGH) {
      waitFirstReleaseMain = false;
      noInterrupts();
      btnMain.irqFell = false;
      interrupts();
      btnMain.lastRaw = false;
      btnMain.isPressed = false;
      btnMain.longFired = false;
    } else {
      // Кнопка ещё держится с момента wake — поддерживаем подсветку и выходим.
      lastActivityTime = millis();
      lcd_backlight_activity(lcd);
      return;
    }
  }

  // v5.0.3: раздельные пороги по кнопкам.
  // MAIN: тара 3.0 сек, калибровка 6.0 сек. MENU: на 1/8 за 2.5 сек, без MEDIUM.
  ButtonAction actMain = read_button(BUTTON_PIN,    btnMain, 3000UL, 6000UL);
  ButtonAction actMenu = read_button(MENU_BTN_PIN,  btnMenu,    0UL, 2500UL);

  // Подсветка: реагировать на физическое нажатие сразу, не ждать debounce/release
  bool anyPressed = (digitalRead(BUTTON_PIN) == LOW || digitalRead(MENU_BTN_PIN) == LOW);
  if (anyPressed || actMain != NO_ACTION || actMenu != NO_ACTION) {
    lastActivityTime = millis();
    lcd_backlight_activity(lcd);
  }

  // Визуальная подсказка во время удержания MAIN — пользователь сразу видит, когда отпускать.
  // Показываем только на главных экранах (не calib/diag, там SHORT работает иначе).
  static int mainHintLevel = 0;
  if (sys.menuScreen != SCR_CALIB && sys.menuScreen != SCR_DIAG) {
    unsigned long mainHeld = button_hold_ms(btnMain);
    int level = 0;
    if (mainHeld >= 6000UL) level = 2;
    else if (mainHeld >= 3000UL) level = 1;
    if (level != mainHintLevel) {
      if (level == 1) {
        lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otpust = TARA!  ");
      } else if (level == 2) {
        lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otpust = KALIBR ");
      }
      // level == 0 (release) — обработчики MEDIUM/LONG ниже сами перерисуют LCD.
      mainHintLevel = level;
    }
  }

  // Логика MAIN-кнопки (v5.0.2 — возврат к v5.0.0 схеме):
  //   SHORT (быстрое нажатие, < 3.5 сек)         — на экранах 6/7 спец-режимы; иначе ничего
  //                                                 (просто будит экран / лечит подсветку,
  //                                                  случайных тарирований больше нет)
  //   MEDIUM (отпустил после ≥ 3.5 сек, < 6.5 c) — запрос подтверждения "Tara? MENU=OK".
  //                                                 Тара выполняется при нажатии MENU SHORT
  //                                                 в окне 4 сек, иначе — отмена.
  //   LONG (≥ 6.5 сек удержания, auto-fire)      — старт калибровочного мастера.
  static bool tareConfirmPending = false;
  static unsigned long tareConfirmStartMs = 0;

  if (actMain == SHORT_PRESS) {
    if (sys.menuScreen == SCR_CALIB) {
      adjust_calibration();
      sys.needsRedraw = true;
    } else if (sys.menuScreen == SCR_DIAG) {
      diagRunRequested = true;
      sys.needsRedraw = true;
    }
    // На остальных экранах MAIN SHORT — ничего: просто разбудили дисплей.
  }

  if (actMain == MEDIUM_PRESS && sys.menuScreen != SCR_CALIB && sys.menuScreen != SCR_DIAG) {
    tareConfirmPending = true;
    tareConfirmStartMs = millis();
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0); lcd_print_padded(lcd, "Tara? MENU=OK   ");
    lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otmena cherez 4s");
  }

  if (actMain == LONG_PRESS && sys.menuScreen != SCR_CALIB && sys.menuScreen != SCR_DIAG) {
    tareConfirmPending = false;
    perform_calibration();
    sys.needsRedraw = true;
  }

  // Перехватываем MENU SHORT в режиме подтверждения тары — иначе он бы переключил меню.
  if (tareConfirmPending && actMenu == SHORT_PRESS) {
    tareConfirmPending = false;
    perform_taring();
    sys.needsRedraw = true;
    return;
  }

  // Таймаут окна подтверждения (4 сек) — тихая отмена с сообщением.
  if (tareConfirmPending && (millis() - tareConfirmStartMs > 4000UL)) {
    tareConfirmPending = false;
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0); lcd_print_padded(lcd, "Tara: otmena    ");
    lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "                ");
    { unsigned long _t=millis(); while(millis()-_t<800UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
  }
  static int menuPressCount = 0;
  static unsigned long lastMenuPressTime = 0;

  if (actMenu == SHORT_PRESS) {
    menuPressCount++;
    if (menuPressCount == 1) {
      lastMenuPressTime = millis();
    } else if (millis() - lastMenuPressTime < 500UL) {
      if (sys.hasPrevOffset) {
        undo_tare();
      } else {
        // Нет предыдущей тары — двойное нажатие = просто ещё один шаг меню
        sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
        sys.needsRedraw = true;
      }
      menuPressCount = 0;
      return;
    } else {
      // Второе нажатие, но окно 500мс истекло (loop блокировался process_weight)
      // Прокручиваем меню за первое нажатие, текущее становится новым первым
      sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
      sys.needsRedraw = true;
      menuPressCount = 1;
      lastMenuPressTime = millis();
    }
  }
  if (menuPressCount == 1 && millis() - lastMenuPressTime >= 500UL) {
    sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
    sys.needsRedraw = true;
    menuPressCount = 0;
  }
  if (actMenu == LONG_PRESS) {
    sys.menuScreen = 0;
    menuPressCount = 0;
    sys.needsRedraw = true;
  }
}

void process_weight() {
  static unsigned long lastSaveTime         = 0;
  static unsigned long lastStableSaveTime   = 0;
  static unsigned long lastReadTime         = 0;
  static unsigned long lastPrevWeightSave   = 0;
  static float         lastSavedPrevWeight  = NAN;
  static float stableBuf[STABLE_BUF_SIZE];
  static int   stableBufIdx = 0;
  static int   stableBufCnt = 0;
  static bool  stableSaved  = false;

