darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
void display_screen_weight() {
  char buf[24];
  lcd_set_cursor(lcd,0, 0);
  snprintf(buf, sizeof(buf), "Ves:%6.1f%ckg", sys.smoothedWeight, sys.weightStable ? '*' : ' ');
  lcd_print_padded(lcd, buf);
  lcd_set_cursor(lcd,0, 1);
  if (sys.currentTime.valid) {
    snprintf(buf, sizeof(buf), "%02u:%02u:%02u %s",
             sys.currentTime.hour, sys.currentTime.minute, sys.currentTime.second,
             sys.wifiOk ? " W" : "  ");
  } else {
    snprintf(buf, sizeof(buf), "No RTC     %s", sys.wifiOk ? " W" : "  ");
  }
  lcd_print_padded(lcd, buf);
}

void display_screen_temp() {
  char buf[24];
  lcd_set_cursor(lcd,0, 0);
  if (sys.tempData.valid) {
    if (isnan(sys.rtcTempC)) snprintf(buf, sizeof(buf), "T:%.1fC  R:---", sys.tempData.temperature);
    else snprintf(buf, sizeof(buf), "T:%.1fC R:%.1fC", sys.tempData.temperature, sys.rtcTempC);
  } else {
    if (isnan(sys.rtcTempC)) snprintf(buf, sizeof(buf), "T:---   R:---");
    else snprintf(buf, sizeof(buf), "T:---  R:%.1fC", sys.rtcTempC);
  }
  lcd_print_padded(lcd, buf);

  lcd_set_cursor(lcd,0, 1);
  if (sys.tempData.humidity > -90) {
    snprintf(buf, sizeof(buf), "H: %4.1f %%", sys.tempData.humidity);
  } else {
    snprintf(buf, sizeof(buf), "H: -- %%  (DS18)");
  }
  lcd_print_padded(lcd, buf);
}

void display_screen_diff() {
  char buf[24];
  float diff = sys.smoothedWeight - sys.prevWeight;
  lcd_set_cursor(lcd,0, 0);
  snprintf(buf, sizeof(buf), "D:%+6.1fkg", diff);
  lcd_print_padded(lcd, buf);
  lcd_set_cursor(lcd,0, 1);
  snprintf(buf, sizeof(buf), "Pred:%5.1fkg", sys.prevWeight);
  lcd_print_padded(lcd, buf);
}

void display_screen_status() {
  char buf[24];
  lcd_set_cursor(lcd,0, 0);
  snprintf(buf, sizeof(buf), "CF:%.0f", sys.calibrationFactor);
  lcd_print_padded(lcd, buf);
  lcd_set_cursor(lcd,0, 1);
  snprintf(buf, sizeof(buf), "W:%s N:%lu",
           sys.wifiOk ? "OK" : "--", persist.wakeupCount);
  lcd_print_padded(lcd, buf);
}

void display_screen_datetime() {
  lcd_set_cursor(lcd,0, 0);
  lcd_print_padded(lcd, rtc_format_datetime(sys.currentTime));
  lcd_set_cursor(lcd,0, 1);
  lcd_print_padded(lcd, sys.currentTime.valid ? "RTC OK          " : "RTC ERROR!      ");
}

void display_screen_battery() {
  char buf[24];
  lcd_set_cursor(lcd,0, 0);
  snprintf(buf, sizeof(buf), "Bat:%4.2fV %3d%%", sys.batVoltage, sys.batPercent);
  lcd_print_padded(lcd, buf);
  lcd_set_cursor(lcd,0, 1);
  if (sys.batPercent < 10) {
    lcd_print_padded(lcd, "!LOW BATTERY!   ");
  } else {
    lcd_print_padded(lcd, "Li-Ion 1S       ");
  }
}

// v5.0.67: экран с IP-адресом и mDNS-именем.
// Раньше IP печатался только в Serial — чтобы зайти на сайт, приходилось искать
// адрес в админке роутера. DHCP-аренда меняется, особенно после долгого простоя.
void display_screen_ip() {
  char buf[24];
  lcd_set_cursor(lcd, 0, 0);
  if (sys.wifiOk) {
    // Режим определяем по факту: STA мог упасть и уйти в AP-fallback (см. loop()).
    bool apMode = (get_wifi_mode() == 0) || (WiFi.getMode() == WIFI_AP);
    IPAddress ip = apMode ? WiFi.softAPIP() : WiFi.localIP();
    if (apMode) snprintf(buf, sizeof(buf), "AP %s", ip.toString().c_str());
    else        snprintf(buf, sizeof(buf), "%s", ip.toString().c_str());
    lcd_print_padded(lcd, buf);
    lcd_set_cursor(lcd, 0, 1);
    // Ровно 16 символов — потому имя хоста короткое (см. MDNS_HOSTNAME).
    lcd_print_padded(lcd, "mDNS: " MDNS_HOSTNAME ".local");
  } else {
    lcd_print_padded(lcd, "WiFi: net svyazi");
    lcd_set_cursor(lcd, 0, 1);
    lcd_print_padded(lcd, "IP nedostupen   ");
  }
}

void display_screen_calib_menu() {
  char buf[24];
  lcd_set_cursor(lcd,0, 0);
  snprintf(buf, sizeof(buf), "CF:%.1f", sys.calibrationFactor);
  lcd_print_padded(lcd, buf);
  lcd_set_cursor(lcd,0, 1);
  lcd_print_padded(lcd, "MAIN=Vojti      ");
}

void display_screen_diag() {
  int diagPass = 0;
  const int diagTotal = 4;

  // Запуск теста: при входе на экран (diagDone ещё false) или по кнопке
  if (diagRunRequested || !diagDone) {
    diagRunRequested = false;

    char buf[17];
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0);
    lcd_print_padded(lcd, "Diagnostika...");

    Serial.println(F("[DIAG] Start"));

    // --- HX711 ---
    lcd_set_cursor(lcd,0, 1);
    bool hx711ok = check_sensor(scale);
    if (hx711ok) {
      long raw = scale.read();
      lcd_print_padded(lcd, "HX711...    OK");
      Serial.print(F("[DIAG] HX711: OK (raw="));
      Serial.print(raw);
      Serial.println(F(")"));
      diagPass++;
    } else {
      lcd_print_padded(lcd, "HX711...  FAIL");
      Serial.println(F("[DIAG] HX711: FAIL"));
    }
    delay(1000);
    app_wdt_reset(); yield();

    // --- DS18B20 ---
    lcd_set_cursor(lcd,0, 1);
    if (!temp_available()) {
      lcd_print_padded(lcd, "DS18B20... FAIL");
      Serial.println(F("[DIAG] DS18B20: not found"));
    } else {
      // Первое чтение после init может быть невалидным (_firstRead).
      // Делаем два попытки с паузой, чтобы получить реальный результат.
      TempData td = temp_read();
      if (!td.valid) {
        delay(1100); app_wdt_reset();
        td = temp_read();
      }
      if (td.valid) {
        lcd_print_padded(lcd, "DS18B20...  OK");
        Serial.print(F("[DIAG] DS18B20: OK (temp="));
        Serial.print(td.temperature, 1);
        Serial.println(F(")"));
        diagPass++;
      } else {
        lcd_print_padded(lcd, "DS18B20..READ!");
        Serial.print(F("[DIAG] DS18B20: found but read FAIL ("));
        Serial.print(td.temperature, 1);
        Serial.println(F(")"));
      }
    }
    delay(1000);
    app_wdt_reset(); yield();

    // --- RTC ---
    lcd_set_cursor(lcd,0, 1);
    TimeStamp ts = rtc_now();
    bool rtcok = ts.valid;
    if (rtcok) {
      lcd_print_padded(lcd, "RTC...      OK");
      Serial.print(F("[DIAG] RTC: OK ("));
      snprintf(buf, sizeof(buf), "%02u.%02u.%04u", ts.day, ts.month, ts.year);
      Serial.print(buf);
      snprintf(buf, sizeof(buf), " %02u:%02u", ts.hour, ts.minute);
      Serial.print(buf);
      Serial.println(F(")"));
      diagPass++;
    } else {
      lcd_print_padded(lcd, "RTC...    FAIL");
      Serial.println(F("[DIAG] RTC: FAIL"));
    }
    delay(1000);
    app_wdt_reset(); yield();

    // --- Battery ---
    lcd_set_cursor(lcd,0, 1);
    float bv = bat_voltage();
    bool batok = bv > 0.5f;
    if (batok) {
      lcd_print_padded(lcd, "Battery...  OK");
      Serial.print(F("[DIAG] Battery: OK ("));
      Serial.print(bv, 2);
      Serial.print(F("V, "));
      Serial.print(bat_percent());
      Serial.println(F("%)"));
      diagPass++;
    } else {
      lcd_print_padded(lcd, "Battery.. FAIL");
      Serial.print(F("[DIAG] Battery: FAIL ("));
      Serial.print(bv, 2);
      Serial.println(F("V)"));
    }
    delay(1000);
    app_wdt_reset(); yield();

    // --- Сводка ---
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0);
    snprintf(buf, sizeof(buf), "Diag: %d/%d %s", diagPass, diagTotal,
             diagPass == diagTotal ? " OK" : "FAIL");
    lcd_print_padded(lcd, buf);
    lcd_set_cursor(lcd,0, 1);
    lcd_print_padded(lcd, "MAIN=povtor");

    Serial.print(F("[DIAG] Result: "));
    Serial.print(diagPass);
    Serial.print('/');
    Serial.print(diagTotal);
    Serial.println(diagPass == diagTotal ? F(" OK") : F(" FAIL"));

    diagDone = true;
  }
  // Если diagDone — сводка уже на экране, ничего не делаем (ждём кнопку)
}

void adjust_calibration() {
  Serial.println(F("[AdjCal] Enter"));
  float cf = sys.calibrationFactor;
  const float steps[] = {10.0f, 1.0f, 0.1f};
  int stepIdx = 0;
  char buf[24];

  lcd_clear_buf(lcd);
  unsigned long lastWeighTime = 0;
  float liveWeight = sys.smoothedWeight;
  unsigned long adjustStart = millis();

